In [3]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}, index=['A B C D'.split()])
df.head()

   col1  col2 col3
A     1   444  abc
B     2   555  def
C     3   666  ghi
D     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col1'] > 2]

   col1  col2 col3
C     3   666  ghi
D     4   444  xyz

In [9]:
def mult(x):
    return x * 2

In [10]:
df['col1'].apply(mult)

A    2
B    4
C    6
D    8
Name: col1, dtype: int64

In [11]:
df.index

MultiIndex(levels=[['A', 'B', 'C', 'D']],
           codes=[[0, 1, 2, 3]])

In [12]:
df.sort_values(by='col2')

   col1  col2 col3
A     1   444  abc
D     4   444  xyz
B     2   555  def
C     3   666  ghi